app/controllers/students_controller.rb

SELECT "students".* FROM "students"
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @students = Student.all
    @student = @students.find(params[:id])